<template>
  <div class="themeItem">
    <img src="@/assets/yrimg/theme7-7.jpg" alt="" class="topimg" />
     <div class="theme1">
      <NavTitle :navtitle="arr6[6]"></NavTitle>
      <ThemeText :text="arr5[6]"></ThemeText>
    </div>
    <BigComponent></BigComponent>
  </div>
</template>

<script>
export default {
  data() {
    return {
      arr5:[
        " 元，谓'始'，凡数之始称为'元'；旦，谓'日'；'元旦'意即'初始之日'。元旦又称'三元'，即岁之元、月之元、时之元。由于地理环境和历法的不同，在不同时代，世界各国、各民族元旦的时间定位各不尽相同。现在，公历日益为世界各国所公认。世界上大多数国家都采用了国际通行的公历，把每年1月1日作为'元旦'。以公历为历法的国家，都以每年公历1月1日为元旦日，举国放假。",
        "春节，即农历新年，是一年之岁首、传统意义上的年节，春节黄金周因此更显“珍贵”。一年的辛劳，高楼大厦的环境早已呆腻，公式化的生活更是让人觉得麻木，都市里虽然也有让人放松的地方，可哪里比得上自然界的盛景，、阳光沙滩、林海雪域？于是，你会想背起行囊，在这个岁末好好奖赏自己。",
        "清明是中华民族古老的节日，又称踏青节、行清节、三月节、祭祖节，节期在仲春与暮春之交。既是一个扫墓祭祖的肃穆节日，也是人们亲近自然、踏青游玩、享受春天乐趣的欢乐节日。清明节气一般是在公历4月5号前后，即春分后第15日。这一时节，生气旺盛、阴气衰退，万物“吐故纳新”，大地呈现春和景明之象，正是郊外踏青春游与行清墓祭的好时段。",
        "5月1日国际劳动节，目前世界上有80多个国家庆祝。这个节日的源头，就是1889年7月，由恩格斯领导的第二国际在巴黎举行代表大会，正式通过决议，规定1890年5月1日国际劳动者举行游行，并将这一天定为国际劳动节。至今，国际劳动节已经历了一百多年的风风雨雨。",
        "端午节，又称端阳节、重午节、午日节、龙舟节、正阳节、浴兰节、天中节等，是中国民间的传统节日。端午节源自天象崇拜，由上古时代龙图腾祭祀演变而来。端午节，起源于中国，最初是上古先民以龙舟竞渡形式祭祀龙祖的节日。因战国时期的楚国诗人屈原在端午节抱石跳汨罗江自尽，后来人们亦将端午节作为纪念屈原的节日；个别地方也有纪念伍子胥、曹娥及介子推等说法。",
        "​中秋节，又称祭月节、月光诞、月夕、秋节、仲秋节等，是中国民间的传统节日。中秋节源自天象崇拜，由上古时代秋夕祭月演变而来。中秋节起源于上古时代，普及于汉代，定型于唐朝初年，盛行于宋朝以后。中秋节是秋季时令习俗的综合，其所包含的节俗因素，大都有着古老的渊源。中秋节以月之圆兆人之团圆，为寄托思念故乡，思念亲人之情，祈盼丰收、幸福，成为丰富多彩、弥足珍贵的文化遗产。",
        "​国庆节是由一个国家制定的用来纪念国家本身的法定假日。“国庆”一词，本指国家喜庆之事，最早见于西晋。西晋的文学家陆机在《五等诸侯论》一文中就曾有“国庆独飨其利，主忧莫与其害”的记载、我国封建时代、国家喜庆的大事，莫大过于帝王的登基、诞辰（清朝称皇帝的生日为万岁节）等。因而我国古代把皇帝即位、诞辰称为“国庆”。今天称国家建立的纪念日为国庆节。",
        "​春游，古称踏青，是一种古老的传统族民俗文体活动，古时一般在上巳节，清明节。“三月三日气象新，长安水边多丽人。”杜甫描绘的就是唐代人们春游的盛况。 春季郊野，万木吐翠，芳草茵茵，百鸟争鸣，阳光和熙，空气清新，置身于这如诗如画的环境中，能使人心胸开阔，疲劳消除，精神振奋，还能促进细胞的新陈代谢，改善血液循环，增加腰腿肌肉的活动，加强心脏和肺的功能，可降低血脂、血压、防治心血管病，因而，春游具有特殊的保健作用。",
        "​在中国，学校通常将每个学年分为上、下两个学期。上学期从秋季八月中旬或九月初开始，到第二年的一月底（或一月中旬，东北地区多为1月上旬）左右结束。此时各学校开始放假，而这个假期正处于中国寒冷的冬季，就称为寒假，寒假一般正月十五结束。下学期从春季二月中旬（阴历正月十六）开始，到七月初或七月中旬结束，各学校又开始放假，而这个假期正处于中国最炎热的夏季，暑气逼人，就被称为暑假。",
        "秋日的山林，娇艳欲滴秋意浓，姹紫嫣红枝叶俏，是彩林最美的季节。每到醉人的金秋时节，川西便成了彩色的海洋，一个绚丽的色彩王国。从谷底到山巅，千叶万树，色彩纷呈，一树引领，满沟呼应，整个山林都跃动起来点点的红，翠翠的绿，片片的黄，如彩带，似织锦。每一片森林，都犹如天然的巨幅油画，光怪陆离，使人目眩。缤纷色彩在秋意融融中凸现，秋日的海子层林尽染，红叶黄叶遍布山野，幽蓝湖水如诗如画。",
        "你见过冬天的川西吗？向大家推荐过很多次川西美景。其中秋景最为绚烂，由于气温较低（可低至零下20℃）。川西的冬，相信很少有人畅游，川西的冬，相信很少有人畅游。更多的是通过照片感受那凛冽的美丽，如果你准备冬天出去流浪，那么川西，你一定要去看一看。",
      ],
       arr6:[
        "元旦节旅行活动一览表",
        "春节旅行活动一览表",
        "清明节旅行活动一览表",
        "五一节旅行活动一览表",
        "端午节旅行活动一览表",
        "中秋节旅行活动一览表",
        "国庆节旅行活动一览表",
        "春暖花开活动一览表",
        "暑假嗨游旅行活动一览表",
        "金秋彩林旅行活动一览表",
        "冬游川西旅行活动一览表",
      ]
    };
  },
  components: {
    NavTitle: () => import("@/components/yrcomponents/NavTitle.vue"),
    ThemeText: () => import("@/components/yrcomponents/ThemeText.vue"),
    BigComponent: () => import("@/components/yrcomponents/BigComponent.vue"),
  },
};
</script>

<style>
.topimg {
  width: 100%;
  height: 400px;
}

.themeItem {
  width: 100%;
  height: 2880px;
  background-color: #006666;
  box-sizing: border-box;
}
.theme1 {
  margin-top: 30px;
}
</style>